In [1]:
import mysql.connector
from sqlalchemy import create_engine
import pandas as pd
import os
import numpy as np

In [2]:
%load_ext sql


# Poprawna konfiguracja połączenia
username = 'root'          # Użytkownik MySQL
password = 'haslo'             # Hasło użytkownika
host = '127.0.0.1'         # Adres hosta (localhost)
port = 3306                # Port MySQL
database = 'aml'           # Nazwa bazy danych


# Tworzenie connection string
connection_string = f"mysql+mysqlconnector://{username}:{password}@{host}:{port}/{database}"

# Załadowanie połączenia

%sql $connection_string

'Connected: root@aml'

In [3]:
%%sql

SHOW TABLES;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
10 rows affected.

[('account_details',),
 ('address',),
 ('countries',),
 ('currency_rates',),
 ('customer',),
 ('customer_info',),
 ('customer_status',),
 ('suspicious_transaction_log',),
 ('transactions',),
 ('trigger_logs',)]

In [4]:
%%sql
DESC countries;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
5 rows affected.

[('country_id', 'varchar(5)', 'NO', 'PRI', None, ''),
 ('country_name', 'varchar(100)', 'YES', '', None, ''),
 ('KRYT_1', 'float', 'YES', '', None, ''),
 ('KRYT_2', 'float', 'YES', '', None, ''),
 ('KRYT_3', 'float', 'YES', '', None, '')]

In [5]:
%%sql

SELECT *
FROM countries;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
12 rows affected.

[('AFG', 'Afghanistan', 4.0, 5.0, 3.294),
 ('COL', 'Colombia', 3.0, 2.85714, 2.887),
 ('DEU', 'Germany', 1.1, 0.714286, 1.542),
 ('FIN', 'Finland', 0.65, 0.0, 1.474),
 ('GEO', 'Georgia', 2.35, 3.57143, 2.195),
 ('GHA', 'Ghana', 2.85, 5.0, 1.938),
 ('GRC', 'Greece', 2.55, 3.57143, 1.793),
 ('IRL', 'Ireland', 1.15, 1.42857, 1.303),
 ('LVA', 'Latvia', 2.0, 2.14286, 1.661),
 ('POL', 'Poland', 2.3, 2.14286, 1.678),
 ('PRT', 'Portugal', 1.95, 2.85714, 1.372),
 ('RUS', 'Russia', 3.7, 5.0, 3.249)]

In [6]:
%%sql

ALTER TABLE countries
ADD COLUMN c_risk_level TINYINT DEFAULT 2;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
0 rows affected.

[]

In [7]:
%%sql

UPDATE countries
SET c_risk_level = CAST(0.45 * KRYT_1 + 0.15 * KRYT_2 + 0.4 * KRYT_3 AS SIGNED);


SELECT *
FROM countries;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
12 rows affected.
12 rows affected.

[('AFG', 'Afghanistan', 4.0, 5.0, 3.294, 4),
 ('COL', 'Colombia', 3.0, 2.85714, 2.887, 3),
 ('DEU', 'Germany', 1.1, 0.714286, 1.542, 1),
 ('FIN', 'Finland', 0.65, 0.0, 1.474, 1),
 ('GEO', 'Georgia', 2.35, 3.57143, 2.195, 2),
 ('GHA', 'Ghana', 2.85, 5.0, 1.938, 3),
 ('GRC', 'Greece', 2.55, 3.57143, 1.793, 2),
 ('IRL', 'Ireland', 1.15, 1.42857, 1.303, 1),
 ('LVA', 'Latvia', 2.0, 2.14286, 1.661, 2),
 ('POL', 'Poland', 2.3, 2.14286, 1.678, 2),
 ('PRT', 'Portugal', 1.95, 2.85714, 1.372, 2),
 ('RUS', 'Russia', 3.7, 5.0, 3.249, 4)]

In [8]:
%%sql

SELECT * 
FROM customer
LIMIT 10;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
10 rows affected.

[(1, 'Kowalski', 'Jan', 'Adam', datetime.date(1985, 2, 15)),
 (2, 'Nowak', 'Anna', 'Maria', datetime.date(1990, 6, 12)),
 (3, 'Wiśniewski', 'Piotr', None, datetime.date(1978, 9, 23)),
 (4, 'Wiśniewska', 'Anna', 'Maria', datetime.date(2005, 9, 23)),
 (5, 'Müller', 'Hans', 'Johann', datetime.date(1980, 1, 11)),
 (6, 'Müller', 'Hannah', 'NULL', datetime.date(1987, 4, 10)),
 (7, 'Schmidt', 'Julia', None, datetime.date(1995, 3, 25)),
 (8, 'Schneider', 'Klaus', 'Friedrich', datetime.date(1987, 7, 30)),
 (9, 'Virtanen', 'Matti', 'Juhani', datetime.date(1992, 12, 14)),
 (10, 'Korhonen', 'Laura', 'Elina', datetime.date(1988, 4, 5))]

In [9]:
%%sql

SELECT * 
FROM address
LIMIT 10;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
10 rows affected.

[(1, 'POL', 'Warsaw', 'Marszałkowska', '10A', '00-017'),
 (2, 'POL', 'Krakow', 'Floriańska', '22', '31-021'),
 (3, 'POL', 'Gdansk', 'Długa', '5B', '80-831'),
 (4, 'DEU', 'Berlin', 'Unter den Linden', '45', '10117'),
 (5, 'DEU', 'Munich', 'Marienplatz', '8', '80331'),
 (6, 'DEU', 'Hamburg', 'Reeperbahn', '18A', '20359'),
 (7, 'FIN', 'Helsinki', 'Mannerheimintie', '12', '00100'),
 (8, 'FIN', 'Espoo', 'Otaniementie', '5C', '02150'),
 (9, 'FIN', 'Tampere', 'Hämeenkatu', '34', '33200'),
 (10, 'AFG', 'Kabul', 'Shahre Naw', '77', '1001')]

In [10]:
%%sql

SELECT *
FROM customer_status
LIMIT 10;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
10 rows affected.

[(1, 2.0, 1.0, datetime.datetime(2018, 6, 1, 12, 15), 12),
 (2, 1.0, 1.0, datetime.datetime(2019, 5, 25, 9, 30), 5),
 (3, 3.0, 2.0, datetime.datetime(1999, 6, 10, 14, 45), 22),
 (4, 2.0, 1.0, datetime.datetime(2021, 4, 15, 11, 20), 15),
 (5, 2.0, 2.0, datetime.datetime(2019, 5, 20, 8, 50), 10),
 (6, 1.0, 1.0, datetime.datetime(2020, 5, 28, 10, 10), 5),
 (7, 3.0, 2.0, datetime.datetime(2021, 6, 5, 16, 0), 25),
 (8, 1.0, 1.0, datetime.datetime(2022, 4, 1, 7, 45), 0),
 (9, 2.0, 1.0, datetime.datetime(2020, 3, 20, 13, 0), 12),
 (10, 2.0, 2.0, datetime.datetime(2021, 6, 12, 15, 10), 18)]

In [11]:
%%sql

SELECT * 
FROM account_details 
LIMIT 10;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
10 rows affected.

[(1, 'PL9876543210987654', Decimal('75060.50'), 'PLN', datetime.datetime(2008, 6, 12, 11, 0), None),
 (2, 'PL1122334455667788', Decimal('9500.00'), 'PLN', datetime.datetime(1996, 9, 23, 10, 30), None),
 (3, 'PL9988776655443322', Decimal('3000.00'), 'PLN', datetime.datetime(2023, 9, 23, 12, 0), None),
 (4, 'DE1234567890123456', Decimal('80000.75'), 'EUR', datetime.datetime(1998, 1, 11, 8, 45), None),
 (5, 'DE9876543210987654', Decimal('4200.25'), 'EUR', datetime.datetime(2005, 4, 10, 9, 15), None),
 (6, 'DE1122334455667788', Decimal('5000.50'), 'EUR', datetime.datetime(2013, 3, 25, 10, 0), None),
 (7, 'DE9988776655443322', Decimal('7200.00'), 'EUR', datetime.datetime(2009, 7, 30, 11, 0), None),
 (8, 'FI1234567890123456', Decimal('12000.00'), 'EUR', datetime.datetime(2010, 12, 14, 14, 30), None),
 (9, 'FI9876543210987654', Decimal('60000.00'), 'EUR', datetime.datetime(2006, 4, 5, 12, 45), None),
 (10, 'FI1122334455667788', Decimal('4000.25'), 'EUR', datetime.datetime(1993, 8, 17, 10, 30), None)]

In [12]:
%%sql
SELECT *
FROM customer_info
LIMIT 10;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
10 rows affected.

[(1, 1, 1, 1, 1),
 (2, 2, 2, 2, 2),
 (3, 3, 3, 3, 3),
 (4, 4, 4, 4, 4),
 (5, 5, 5, 5, 5),
 (6, 6, 6, 6, 6),
 (7, 7, 7, 7, 7),
 (8, 8, 8, 8, 8),
 (9, 9, 9, 9, 9),
 (10, 10, 10, 10, 10)]

In [13]:
%%sql

SELECT *
FROM transactions
LIMIT 10;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
0 rows affected.

[]

In [14]:
%%sql
SELECT * 
FROM suspicious_transaction_log 
LIMIT 10;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
0 rows affected.

[]

In [15]:
%%sql
SELECT * FROM suspicious_transaction_log;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
0 rows affected.

[]

In [16]:
%%sql
SELECT * FROM transactions;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
0 rows affected.

[]

In [17]:
## SPRAWDZENIE POPRAWNOŚCI LOGIKI

In [18]:
%%sql
#1 

DESC customer_status;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
5 rows affected.

[('customer_stat_id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('current_risk_level', 'float', 'YES', '', '1', ''),
 ('previous_risk_level', 'float', 'YES', '', '1', ''),
 ('change_date', 'timestamp', 'YES', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED'),
 ('risk_points', 'int', 'YES', '', '0', '')]

In [19]:
%%sql

WITH ranked_customers AS (
    SELECT 
        *,
        ROW_NUMBER() OVER (PARTITION BY current_risk_level ORDER BY risk_points DESC) AS row_numb
    FROM 
        customer_status cs
)
SELECT *
FROM ranked_customers
WHERE row_numb <= 2
ORDER BY current_risk_level, row_numb;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
7 rows affected.

[(24, 1.0, 1.0, datetime.datetime(2019, 3, 30, 8, 45), 8, 1),
 (2, 1.0, 1.0, datetime.datetime(2019, 5, 25, 9, 30), 5, 2),
 (13, 2.0, 2.0, datetime.datetime(2020, 5, 15, 12, 20), 20, 1),
 (23, 2.0, 2.0, datetime.datetime(2020, 4, 18, 9, 30), 18, 2),
 (12, 3.0, 2.0, datetime.datetime(2019, 6, 8, 14, 40), 30, 1),
 (35, 3.0, 2.0, datetime.datetime(2022, 6, 1, 15, 25), 30, 2),
 (15, 4.0, 3.0, datetime.datetime(2021, 6, 2, 9, 45), 40, 1)]

In [20]:
%%sql 
DESC countries;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
6 rows affected.

[('country_id', 'varchar(5)', 'NO', 'PRI', None, ''),
 ('country_name', 'varchar(100)', 'YES', '', None, ''),
 ('KRYT_1', 'float', 'YES', '', None, ''),
 ('KRYT_2', 'float', 'YES', '', None, ''),
 ('KRYT_3', 'float', 'YES', '', None, ''),
 ('c_risk_level', 'tinyint', 'YES', '', '2', '')]

In [21]:
%%sql

SELECT c.customer_id
FROM customer_info c
JOIN address ad 
    ON c.address_id = ad.address_id
JOIN countries ct 
    ON ad.a_country_id = ct.country_id
WHERE ct.country_name = 'Russia';

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
3 rows affected.

[(31,), (32,), (33,)]

In [22]:
%%sql
SELECT * FROM suspicious_transaction_log;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
0 rows affected.

[]

In [23]:
%%sql
DESC transactions;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
10 rows affected.

[('transaction_id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('payer_id', 'int', 'NO', 'MUL', None, ''),
 ('sender_account_id', 'int', 'NO', '', None, ''),
 ('beneficiary_id', 'int', 'YES', 'MUL', None, ''),
 ('beneficiary_account_id', 'int', 'YES', '', None, ''),
 ('amount', 'decimal(10,2)', 'NO', '', None, ''),
 ('currency', 'varchar(3)', 'YES', '', 'PLN', ''),
 ('transaction_date', 'datetime', 'YES', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED'),
 ('transaction_type', "enum('transfer','deposit','withdrawal','fee')", 'NO', '', None, ''),
 ('description', 'varchar(255)', 'YES', '', None, '')]

In [24]:
%%sql 
DESC customer_status;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
5 rows affected.

[('customer_stat_id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('current_risk_level', 'float', 'YES', '', '1', ''),
 ('previous_risk_level', 'float', 'YES', '', '1', ''),
 ('change_date', 'timestamp', 'YES', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED'),
 ('risk_points', 'int', 'YES', '', '0', '')]

In [25]:
%%sql

SELECT ad.balance,ad.currency,ad.account_id, ci.customer_id, cs.current_risk_level, cs.risk_points
FROM account_details ad
JOIN customer_info ci 
    ON ad.account_id = ci.account_id
JOIN customer_status cs
    ON cs.customer_stat_id = ci.status_id
WHERE cs.current_risk_level = 2
ORDER BY cs.risk_points DESC
LIMIT 1;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
1 rows affected.

[(Decimal('1500.50'), 'AFN', 13, 13, 2.0, 20)]

In [26]:
%%sql
CREATE FUNCTION add_transaction(
    in_payer_id INT,
    in_sender_account_id INT,
    in_beneficiary_id INT,
    in_beneficiary_account_id INT,
    in_amount DECIMAL(15, 2),
    in_currency VARCHAR(3),
    in_transaction_type VARCHAR(20),
    in_description VARCHAR(255)
)
RETURNS VARCHAR(255)
READS SQL DATA
BEGIN
    DECLARE transaction_id INT;

    -- Wstawienie nowej transakcji do tabeli
    INSERT INTO transactions (
        payer_id, sender_account_id, beneficiary_id, beneficiary_account_id,
        amount, currency, transaction_type, description
    )
    VALUES (
        in_payer_id, in_sender_account_id, in_beneficiary_id, in_beneficiary_account_id,
        in_amount, in_currency, in_transaction_type, in_description
    );

    -- Pobranie ID dodanej transakcji (AUTO_INCREMENT)
    SET transaction_id = LAST_INSERT_ID();

    -- Zwrócenie informacji o powodzeniu operacji
    RETURN CONCAT('Transaction successfully added with ID: ', transaction_id);
END;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
0 rows affected.

[]

In [27]:
%%sql
SELECT add_transaction(13,13,NULL,13, 50000, 'AFN','deposit',"first cash deposit");

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
1 rows affected.

[('Transaction successfully added with ID: 1',)]

In [28]:
%%sql

SELECT *
FROM trigger_logs;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
1 rows affected.

[(1, 'after_suspicious_log_insert', datetime.datetime(2024, 12, 20, 14, 15, 44), 'Log ID: 1')]

In [29]:
%%sql

SELECT *
FROM transactions;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
1 rows affected.

[(1, 13, 13, None, 13, Decimal('50000.00'), 'AFN', datetime.datetime(2024, 12, 20, 14, 15, 44), 'deposit', 'first cash deposit')]

In [30]:
%%sql 

SELECT * 
FROM suspicious_transaction_log;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
1 rows affected.

[(1, 1, 2.0)]

In [31]:
%%sql

SELECT ad.balance,ad.currency,ad.account_id, ci.customer_id, cs.current_risk_level, cs.risk_points
FROM account_details ad
JOIN customer_info ci 
    ON ad.account_id = ci.account_id
JOIN customer_status cs
    ON cs.customer_stat_id = ci.status_id
WHERE ci.customer_id = 13;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
1 rows affected.

[(Decimal('51500.50'), 'AFN', 13, 13, 2.0, 22)]

In [32]:
%%sql
DESC transactions;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
10 rows affected.

[('transaction_id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('payer_id', 'int', 'NO', 'MUL', None, ''),
 ('sender_account_id', 'int', 'NO', '', None, ''),
 ('beneficiary_id', 'int', 'YES', 'MUL', None, ''),
 ('beneficiary_account_id', 'int', 'YES', '', None, ''),
 ('amount', 'decimal(10,2)', 'NO', '', None, ''),
 ('currency', 'varchar(3)', 'YES', '', 'PLN', ''),
 ('transaction_date', 'datetime', 'YES', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED'),
 ('transaction_type', "enum('transfer','deposit','withdrawal','fee')", 'NO', '', None, ''),
 ('description', 'varchar(255)', 'YES', '', None, '')]

In [33]:
#punkty ryzyka zostały uaktualnione

In [34]:
%%sql

SELECT ad.balance,ad.currency,ad.account_id, ci.customer_id, cs.current_risk_level, cs.risk_points
FROM account_details ad
JOIN customer_info ci 
    ON ad.account_id = ci.account_id
JOIN customer_status cs
    ON cs.customer_stat_id = ci.status_id
WHERE ci.customer_id = 32;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
1 rows affected.

[(Decimal('8000.00'), 'RUB', 32, 32, 2.0, 15)]

In [35]:
%%sql
SELECT add_transaction(13,13,32,32, 50500, 'AFN','deposit',"first cash deposit");

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
1 rows affected.

[('Transaction successfully added with ID: 2',)]

In [36]:
%%sql

SELECT ad.balance,ad.currency,ad.account_id, ci.customer_id, cs.current_risk_level, cs.risk_points
FROM account_details ad
JOIN customer_info ci 
    ON ad.account_id = ci.account_id
JOIN customer_status cs
    ON cs.customer_stat_id = ci.status_id
WHERE ci.customer_id = 32
    OR 
ci.customer_id = 13;

 * mysql+mysqlconnector://root:***@127.0.0.1:3306/aml
2 rows affected.

[(Decimal('51500.50'), 'AFN', 13, 13, 2.0, 34),
 (Decimal('765500.00'), 'RUB', 32, 32, 2.0, 17)]